lab12/app/controllers/chain_controller.rb

  def all_records
    @res = Chain.all
---
SELECT "chains".* FROM "chains"

  def view
    if (rec = Chain.find_by(initial: @n))
---
SELECT  "chains".* FROM "chains" WHERE "chains"."initial" IN ('21', '3', '4', '5', '3', '1', '2', '3', '4', '5', '4', '2', '1', '2', '3') LIMIT ?  [["LIMIT", 1]]